docs/devops.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-01-02 Tue 14:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Dev Ops</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jethro Kuan">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/normalize/7.0.0/normalize.css" />
<link rel="stylesheet" href="./css/orgmin.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Dev Ops</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org31456cf">1. Kubernetes</a>
<ul>
<li><a href="#orgabaa878">1.1. Features of a COE</a></li>
<li><a href="#org8e7cd5f">1.2. Why use kubernetes</a></li>
<li><a href="#orgf1fe6f5">1.3. Downsides to kubernetes</a></li>
<li><a href="#org75cdc3e">1.4. Architecture</a></li>
<li><a href="#org960e912">1.5. Replication controller vs set</a></li>
<li><a href="#orgc838ec8">1.6. Selectors</a></li>
<li><a href="#org9b1e42e">1.7. Kubernetes Schema</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org31456cf" class="outline-2">
<h2 id="org31456cf"><span class="section-number-2">1</span> Kubernetes</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.opencontainers.org/">Open Containers Initiative</a>
</p>
</div>
<div id="outline-container-orgabaa878" class="outline-3">
<h3 id="orgabaa878"><span class="section-number-3">1.1</span> Features of a COE</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>clustering</li>
<li>scheduling</li>
<li>scaling</li>
<li>load balancing (pets to cattle)
<ul class="org-ul">
<li>monitoring services vs monitoring</li>
</ul></li>
<li>fault tolerance</li>
<li>app deployment</li>
</ol>
</div>
</div>
<div id="outline-container-org8e7cd5f" class="outline-3">
<h3 id="org8e7cd5f"><span class="section-number-3">1.2</span> Why use kubernetes</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>google</li>
<li>battle hardened</li>
<li>features</li>
<li>open source</li>
</ol>
</div>
</div>
<div id="outline-container-orgf1fe6f5" class="outline-3">
<h3 id="orgf1fe6f5"><span class="section-number-3">1.3</span> Downsides to kubernetes</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>complex</li>
<li>zero to dev</li>
<li>non-native</li>
</ol>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Colocation</td>
<td class="org-left">Pods</td>
</tr>

<tr>
<td class="org-left">Scaling/Fault Tolerance</td>
<td class="org-left">Replication controllers, replica sets</td>
</tr>

<tr>
<td class="org-left">Load Balancing</td>
<td class="org-left">Services</td>
</tr>

<tr>
<td class="org-left">App Deployment</td>
<td class="org-left">Rolling-updates</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org75cdc3e" class="outline-3">
<h3 id="org75cdc3e"><span class="section-number-3">1.4</span> Architecture</h3>
<div class="outline-text-3" id="text-1-4">
<p>
kubectl &lt;&#x2014; scheduler (which node is used for container launch etc.)
             api server
             controllers manager (replication controller etc.)
             etcd (service discovery)
</p>

<p>
MASTER
</p>
</div>
</div>

<div id="outline-container-org960e912" class="outline-3">
<h3 id="org960e912"><span class="section-number-3">1.5</span> Replication controller vs set</h3>
<div class="outline-text-3" id="text-1-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Controller</th>
<th scope="col" class="org-left">Set</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">old way</td>
<td class="org-left">new way</td>
</tr>

<tr>
<td class="org-left">works with rolling updates</td>
<td class="org-left">supports sets based selectors</td>
</tr>

<tr>
<td class="org-left">imperative</td>
<td class="org-left">part of deployments</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">declarative</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc838ec8" class="outline-3">
<h3 id="orgc838ec8"><span class="section-number-3">1.6</span> Selectors</h3>
<div class="outline-text-3" id="text-1-6">
<p>
eg. I want to select these pods, add it to replication sets
</p>
</div>
</div>

<div id="outline-container-org9b1e42e" class="outline-3">
<h3 id="org9b1e42e"><span class="section-number-3">1.7</span> Kubernetes Schema</h3>
<div class="outline-text-3" id="text-1-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Api Version</td>
<td class="org-left">v1</td>
</tr>

<tr>
<td class="org-left">Kind</td>
<td class="org-left">Pod/ReplicaSet/ReplicaController</td>
</tr>

<tr>
<td class="org-left">Metadata</td>
<td class="org-left">name/labels</td>
</tr>

<tr>
<td class="org-left">Spec</td>
<td class="org-left">Containers</td>
</tr>
</tbody>
</table>

<p>
<a href="https://github.com/schoolofdevops/course-outlines">School of Dev Ops</a>
<a href="https://katacoda.com/">KataCoda</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-02 Tue 14:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
